zapsi_service_likov_terminal_special/repair.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <ProcessXMLDoc xmlns="urn:microsoft-dynamics-schemas/codeunit/ZAPSI">
            <xMLDoc>
                <ZAPSIoperations>
                    <ZAPSIoperation>
                        <type>AL</type>
                        <orderno>VZA-2102930 10000</orderno>
                        <operationno>100</operationno>
                        <workcenter>PC-AL-25</workcenter>
                        <machinecenter>960</machinecenter>
                        <operationtype>Technology</operationtype>
                        <initiator>True</initiator>
                        <startdate>2021-07-12 18:10:12.000</startdate>
                        <enddate>2021-07-12 18:11:33.000</enddate>
                        <consofmeters>66.951</consofmeters>
                        <motorhours>0.02</motorhours>
                        <cuts/>
                        <note>Rychlost-závada na stroji</note>
                    </ZAPSIoperation>
                </ZAPSIoperations>
            </xMLDoc>
        </ProcessXMLDoc>
    </soap:Body>
</soap:Envelope>